app/controllers/songs_controller.rb

  def edit
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artists_path
      else
        @song = artist.posts.find_by(id: params[:id])
        redirect_to artist_songs_path(artist) if @song.nil?
      end
      @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 18]]